using API.Data;
using API.Entity;

namespace API.data
{
    public static class DbInitializer
    {
        public static void Initialize(StoreContext context)
        {
            if (context.Product.Any()) return;
            var products = new List<ProductEntity>{
                new ProductEntity{
                    ProductName="گوشی موبایل شیائومی مدل POCO X3 Pro M2102J20SG دو سیم‌ کارت ظرفیت 256 گیگابایت و 8 گیگابایت رم",
                    Description="گوشی موبایل شیائومی مدل Poco X3 Pro دو سیم‌ کارت ظرفیت 256 گیگابایت از جمله محصولات برند شیائومی که در سال 2021 روانه بازار شده است. این محصول دارای ساختاری متوازن و خوش‌ساخت بدون پشتیبانی از تکنولوژی 5G روانه بازار شده است. این محصول از بدنه پلاستیکی ساخته شده است که قاب جلو شیشه‌ای جلوه ویژه‌ای به این مدل بخشیده است. صفحه‌نمایش گوشی موبایل شیائومی مدل POCO X3 Pro دو سیم‌ کارت ظرفیت 256گیگابایت در اندازه 6.67 منتشر شده است. این صفحه‌نمایش کاملاً تمام‌صفحه است و در بالا وسط اثری از بریدگی یا حفره دوربین سلفی وجود دیده می‌شود. دوربین سلفی این محصول دارای حسگر 20 مگاپیکسلی است .صحفه‌نمایش گوشی موبایل شیائومی مدل POCO X3 با استفاده از فناوری Corning Gorilla Glass 6 در برابر خط‌وخش و صدمات احتمالی محافظت می‌شود. گفتنی است چهار دوربین که سنسور اصلی آن 48 مگاپیکسلی است در قسمت پشتی این گوشی جا خوش کرده‌اند. این دوربین‌ها قادر هستند ویدئوی 4K را ثبت و ضبط کنند. دوربین‌ سلفی این محصول هم به سنسوری 20 مگاپیکسلی مجهز شده است. بلوتوث نسخه 5.0، نسخه 11 سیستم عامل اندروید و باتری 5160 میلی‌آمپرساعتی از دیگر ویژگی‌‌های این گوشی جدید هستند.",
                    Price=6840000,
                    PictureURL="https://dkstatics-public.digikala.com/digikala-products/caa4e7d9543637cf8921b67f26803827c864e269_1618918880.jpg?x-oss-process=image/resize,h_1600/quality,q_80/watermark,image_ZGstdy8xLnBuZw==,t_90,g_nw,x_15,y_15",
                    Type="Xiaomi Mobiles",
                    Brand="Xiaomi",
                    QuantityInStock=100
                },
                new ProductEntity{
                    ProductName="گوشی موبایل شیائومی مدل POCO X3 Pro M2102J20SG دو سیم‌ کارت ظرفیت 256 گیگابایت و 8 گیگابایت رم",
                    Description="گوشی موبایل شیائومی مدل Poco X3 Pro دو سیم‌ کارت ظرفیت 256 گیگابایت از جمله محصولات برند شیائومی که در سال 2021 روانه بازار شده است. این محصول دارای ساختاری متوازن و خوش‌ساخت بدون پشتیبانی از تکنولوژی 5G روانه بازار شده است. این محصول از بدنه پلاستیکی ساخته شده است که قاب جلو شیشه‌ای جلوه ویژه‌ای به این مدل بخشیده است. صفحه‌نمایش گوشی موبایل شیائومی مدل POCO X3 Pro دو سیم‌ کارت ظرفیت 256گیگابایت در اندازه 6.67 منتشر شده است. این صفحه‌نمایش کاملاً تمام‌صفحه است و در بالا وسط اثری از بریدگی یا حفره دوربین سلفی وجود دیده می‌شود. دوربین سلفی این محصول دارای حسگر 20 مگاپیکسلی است .صحفه‌نمایش گوشی موبایل شیائومی مدل POCO X3 با استفاده از فناوری Corning Gorilla Glass 6 در برابر خط‌وخش و صدمات احتمالی محافظت می‌شود. گفتنی است چهار دوربین که سنسور اصلی آن 48 مگاپیکسلی است در قسمت پشتی این گوشی جا خوش کرده‌اند. این دوربین‌ها قادر هستند ویدئوی 4K را ثبت و ضبط کنند. دوربین‌ سلفی این محصول هم به سنسوری 20 مگاپیکسلی مجهز شده است. بلوتوث نسخه 5.0، نسخه 11 سیستم عامل اندروید و باتری 5160 میلی‌آمپرساعتی از دیگر ویژگی‌‌های این گوشی جدید هستند.",
                    Price=6840000,
                    PictureURL="https://dkstatics-public.digikala.com/digikala-products/caa4e7d9543637cf8921b67f26803827c864e269_1618918880.jpg?x-oss-process=image/resize,h_1600/quality,q_80/watermark,image_ZGstdy8xLnBuZw==,t_90,g_nw,x_15,y_15",
                    Type="Xiaomi Mobiles",
                    Brand="Xiaomi",
                    QuantityInStock=100
                },new ProductEntity{
                    ProductName="گوشی موبایل شیائومی مدل POCO X3 Pro M2102J20SG دو سیم‌ کارت ظرفیت 256 گیگابایت و 8 گیگابایت رم",
                    Description="گوشی موبایل شیائومی مدل Poco X3 Pro دو سیم‌ کارت ظرفیت 256 گیگابایت از جمله محصولات برند شیائومی که در سال 2021 روانه بازار شده است. این محصول دارای ساختاری متوازن و خوش‌ساخت بدون پشتیبانی از تکنولوژی 5G روانه بازار شده است. این محصول از بدنه پلاستیکی ساخته شده است که قاب جلو شیشه‌ای جلوه ویژه‌ای به این مدل بخشیده است. صفحه‌نمایش گوشی موبایل شیائومی مدل POCO X3 Pro دو سیم‌ کارت ظرفیت 256گیگابایت در اندازه 6.67 منتشر شده است. این صفحه‌نمایش کاملاً تمام‌صفحه است و در بالا وسط اثری از بریدگی یا حفره دوربین سلفی وجود دیده می‌شود. دوربین سلفی این محصول دارای حسگر 20 مگاپیکسلی است .صحفه‌نمایش گوشی موبایل شیائومی مدل POCO X3 با استفاده از فناوری Corning Gorilla Glass 6 در برابر خط‌وخش و صدمات احتمالی محافظت می‌شود. گفتنی است چهار دوربین که سنسور اصلی آن 48 مگاپیکسلی است در قسمت پشتی این گوشی جا خوش کرده‌اند. این دوربین‌ها قادر هستند ویدئوی 4K را ثبت و ضبط کنند. دوربین‌ سلفی این محصول هم به سنسوری 20 مگاپیکسلی مجهز شده است. بلوتوث نسخه 5.0، نسخه 11 سیستم عامل اندروید و باتری 5160 میلی‌آمپرساعتی از دیگر ویژگی‌‌های این گوشی جدید هستند.",
                    Price=6840000,
                    PictureURL="https://dkstatics-public.digikala.com/digikala-products/caa4e7d9543637cf8921b67f26803827c864e269_1618918880.jpg?x-oss-process=image/resize,h_1600/quality,q_80/watermark,image_ZGstdy8xLnBuZw==,t_90,g_nw,x_15,y_15",
                    Type="Xiaomi Mobiles",
                    Brand="Xiaomi",
                    QuantityInStock=100
                },new ProductEntity{
                    ProductName="گوشی موبایل شیائومی مدل POCO X3 Pro M2102J20SG دو سیم‌ کارت ظرفیت 256 گیگابایت و 8 گیگابایت رم",
                    Description="گوشی موبایل شیائومی مدل Poco X3 Pro دو سیم‌ کارت ظرفیت 256 گیگابایت از جمله محصولات برند شیائومی که در سال 2021 روانه بازار شده است. این محصول دارای ساختاری متوازن و خوش‌ساخت بدون پشتیبانی از تکنولوژی 5G روانه بازار شده است. این محصول از بدنه پلاستیکی ساخته شده است که قاب جلو شیشه‌ای جلوه ویژه‌ای به این مدل بخشیده است. صفحه‌نمایش گوشی موبایل شیائومی مدل POCO X3 Pro دو سیم‌ کارت ظرفیت 256گیگابایت در اندازه 6.67 منتشر شده است. این صفحه‌نمایش کاملاً تمام‌صفحه است و در بالا وسط اثری از بریدگی یا حفره دوربین سلفی وجود دیده می‌شود. دوربین سلفی این محصول دارای حسگر 20 مگاپیکسلی است .صحفه‌نمایش گوشی موبایل شیائومی مدل POCO X3 با استفاده از فناوری Corning Gorilla Glass 6 در برابر خط‌وخش و صدمات احتمالی محافظت می‌شود. گفتنی است چهار دوربین که سنسور اصلی آن 48 مگاپیکسلی است در قسمت پشتی این گوشی جا خوش کرده‌اند. این دوربین‌ها قادر هستند ویدئوی 4K را ثبت و ضبط کنند. دوربین‌ سلفی این محصول هم به سنسوری 20 مگاپیکسلی مجهز شده است. بلوتوث نسخه 5.0، نسخه 11 سیستم عامل اندروید و باتری 5160 میلی‌آمپرساعتی از دیگر ویژگی‌‌های این گوشی جدید هستند.",
                    Price=6840000,
                    PictureURL="https://dkstatics-public.digikala.com/digikala-products/caa4e7d9543637cf8921b67f26803827c864e269_1618918880.jpg?x-oss-process=image/resize,h_1600/quality,q_80/watermark,image_ZGstdy8xLnBuZw==,t_90,g_nw,x_15,y_15",
                    Type="Xiaomi Mobiles",
                    Brand="Xiaomi",
                    QuantityInStock=100
                },new ProductEntity{
                    ProductName="گوشی موبایل اپل مدل iPhone SE 2020 A2275 ظرفیت 128 گیگابایت",
                    Description="شرکت اپل نسل دوم گوشی SEخود را در 15 آوریل 2020 معرفی کرد. این گوشی با بهره‌گیری از سخت‌افزار آیفون 11 و ابعاد جمع‌وجور به‌عنوان گوشی میان رده شرکت اپل روانه بازار شده است. قاب پشتی و جلویی آیفون SE از شیشه و فریم آن از آلومینیوم ساخته شده است. آیفون SE از یک صفحه‌نمایش 4.7 اینچی با فناوری Retina IPS بهره می‌برد. صفحه‌نمایش این گوشی دارای نسبت 16:9 است که رزولوشن آن برابر با 1334 در 750 پیکسل است. آیفون SE این‌بار در ظرفیت 256 گیگابایتی عرضه شده و طبق معمول خبری از امکان استفاده از کارت حافظه‌ی جانبی برای افزایش این مقدار نیست. شرکت اپل در ساخت گوشی SE 2020 از جدیدترین چیپست خود یعنی A13 Bionic با معماری 7nm+ استفاده کرده است. به لطف پردازنده‌ی جدید، آیفون SE می‌تواند به باند‌های LTE بیشتری متصل شود، همچنین از بلوتوث و Wi-Fi با نسخه‌های بالاتر با سرعت‌ بیشتر هم سود می‌برد. با این سنسور علاوه بر این‌که می‌توانید تصاویر با کیفیت‌تری ثبت کنید، می‌توانید تصاویر زنده ثبت کنید، ویدیو‌هایی با رزولوشن 4K ضبط کنید و یا از ضبط ویدیو‌هایی با سرعت 240 فریم بر ثانیه لذت ببرید. باتری آیفون SE خرید این گوشی به کسانی که هنوز از گوشی‌های کوچک استفاده می‌کنند و از نمایشگر‌های 4.7 اینچی رضایت دارند، توصیه می‌شود.",
                    Price=13290000,
                    PictureURL="https://dkstatics-public.digikala.com/digikala-products/122045219.jpg?x-oss-process=image/resize,m_lfit,h_600,w_600/quality,q_90",
                    Type="Iphone Mobiles",
                    Brand="Apple",
                    QuantityInStock=248
                },new ProductEntity{
                    ProductName="گوشی موبایل شیائومی مدل POCO X3 Pro M2102J20SG دو سیم‌ کارت ظرفیت 256 گیگابایت و 8 گیگابایت رم",
                    Description="گوشی موبایل شیائومی مدل Poco X3 Pro دو سیم‌ کارت ظرفیت 256 گیگابایت از جمله محصولات برند شیائومی که در سال 2021 روانه بازار شده است. این محصول دارای ساختاری متوازن و خوش‌ساخت بدون پشتیبانی از تکنولوژی 5G روانه بازار شده است. این محصول از بدنه پلاستیکی ساخته شده است که قاب جلو شیشه‌ای جلوه ویژه‌ای به این مدل بخشیده است. صفحه‌نمایش گوشی موبایل شیائومی مدل POCO X3 Pro دو سیم‌ کارت ظرفیت 256گیگابایت در اندازه 6.67 منتشر شده است. این صفحه‌نمایش کاملاً تمام‌صفحه است و در بالا وسط اثری از بریدگی یا حفره دوربین سلفی وجود دیده می‌شود. دوربین سلفی این محصول دارای حسگر 20 مگاپیکسلی است .صحفه‌نمایش گوشی موبایل شیائومی مدل POCO X3 با استفاده از فناوری Corning Gorilla Glass 6 در برابر خط‌وخش و صدمات احتمالی محافظت می‌شود. گفتنی است چهار دوربین که سنسور اصلی آن 48 مگاپیکسلی است در قسمت پشتی این گوشی جا خوش کرده‌اند. این دوربین‌ها قادر هستند ویدئوی 4K را ثبت و ضبط کنند. دوربین‌ سلفی این محصول هم به سنسوری 20 مگاپیکسلی مجهز شده است. بلوتوث نسخه 5.0، نسخه 11 سیستم عامل اندروید و باتری 5160 میلی‌آمپرساعتی از دیگر ویژگی‌‌های این گوشی جدید هستند.",
                    Price=6840000,
                    PictureURL="https://dkstatics-public.digikala.com/digikala-products/caa4e7d9543637cf8921b67f26803827c864e269_1618918880.jpg?x-oss-process=image/resize,h_1600/quality,q_80/watermark,image_ZGstdy8xLnBuZw==,t_90,g_nw,x_15,y_15",
                    Type="Xiaomi Mobiles",
                    Brand="Xiaomi",
                    QuantityInStock=100
                },new ProductEntity{
                    ProductName="گوشی موبایل شیائومی مدل POCO X3 Pro M2102J20SG دو سیم‌ کارت ظرفیت 256 گیگابایت و 8 گیگابایت رم",
                    Description="گوشی موبایل شیائومی مدل Poco X3 Pro دو سیم‌ کارت ظرفیت 256 گیگابایت از جمله محصولات برند شیائومی که در سال 2021 روانه بازار شده است. این محصول دارای ساختاری متوازن و خوش‌ساخت بدون پشتیبانی از تکنولوژی 5G روانه بازار شده است. این محصول از بدنه پلاستیکی ساخته شده است که قاب جلو شیشه‌ای جلوه ویژه‌ای به این مدل بخشیده است. صفحه‌نمایش گوشی موبایل شیائومی مدل POCO X3 Pro دو سیم‌ کارت ظرفیت 256گیگابایت در اندازه 6.67 منتشر شده است. این صفحه‌نمایش کاملاً تمام‌صفحه است و در بالا وسط اثری از بریدگی یا حفره دوربین سلفی وجود دیده می‌شود. دوربین سلفی این محصول دارای حسگر 20 مگاپیکسلی است .صحفه‌نمایش گوشی موبایل شیائومی مدل POCO X3 با استفاده از فناوری Corning Gorilla Glass 6 در برابر خط‌وخش و صدمات احتمالی محافظت می‌شود. گفتنی است چهار دوربین که سنسور اصلی آن 48 مگاپیکسلی است در قسمت پشتی این گوشی جا خوش کرده‌اند. این دوربین‌ها قادر هستند ویدئوی 4K را ثبت و ضبط کنند. دوربین‌ سلفی این محصول هم به سنسوری 20 مگاپیکسلی مجهز شده است. بلوتوث نسخه 5.0، نسخه 11 سیستم عامل اندروید و باتری 5160 میلی‌آمپرساعتی از دیگر ویژگی‌‌های این گوشی جدید هستند.",
                    Price=6840000,
                    PictureURL="https://dkstatics-public.digikala.com/digikala-products/caa4e7d9543637cf8921b67f26803827c864e269_1618918880.jpg?x-oss-process=image/resize,h_1600/quality,q_80/watermark,image_ZGstdy8xLnBuZw==,t_90,g_nw,x_15,y_15",
                    Type="Xiaomi Mobiles",
                    Brand="Xiaomi",
                    QuantityInStock=100
                },new ProductEntity{
                    ProductName="گوشی موبایل شیائومی مدل POCO X3 Pro M2102J20SG دو سیم‌ کارت ظرفیت 256 گیگابایت و 8 گیگابایت رم",
                    Description="گوشی موبایل شیائومی مدل Poco X3 Pro دو سیم‌ کارت ظرفیت 256 گیگابایت از جمله محصولات برند شیائومی که در سال 2021 روانه بازار شده است. این محصول دارای ساختاری متوازن و خوش‌ساخت بدون پشتیبانی از تکنولوژی 5G روانه بازار شده است. این محصول از بدنه پلاستیکی ساخته شده است که قاب جلو شیشه‌ای جلوه ویژه‌ای به این مدل بخشیده است. صفحه‌نمایش گوشی موبایل شیائومی مدل POCO X3 Pro دو سیم‌ کارت ظرفیت 256گیگابایت در اندازه 6.67 منتشر شده است. این صفحه‌نمایش کاملاً تمام‌صفحه است و در بالا وسط اثری از بریدگی یا حفره دوربین سلفی وجود دیده می‌شود. دوربین سلفی این محصول دارای حسگر 20 مگاپیکسلی است .صحفه‌نمایش گوشی موبایل شیائومی مدل POCO X3 با استفاده از فناوری Corning Gorilla Glass 6 در برابر خط‌وخش و صدمات احتمالی محافظت می‌شود. گفتنی است چهار دوربین که سنسور اصلی آن 48 مگاپیکسلی است در قسمت پشتی این گوشی جا خوش کرده‌اند. این دوربین‌ها قادر هستند ویدئوی 4K را ثبت و ضبط کنند. دوربین‌ سلفی این محصول هم به سنسوری 20 مگاپیکسلی مجهز شده است. بلوتوث نسخه 5.0، نسخه 11 سیستم عامل اندروید و باتری 5160 میلی‌آمپرساعتی از دیگر ویژگی‌‌های این گوشی جدید هستند.",
                    Price=6840000,
                    PictureURL="https://dkstatics-public.digikala.com/digikala-products/caa4e7d9543637cf8921b67f26803827c864e269_1618918880.jpg?x-oss-process=image/resize,h_1600/quality,q_80/watermark,image_ZGstdy8xLnBuZw==,t_90,g_nw,x_15,y_15",
                    Type="Xiaomi Mobiles",
                    Brand="Xiaomi",
                    QuantityInStock=100
                },new ProductEntity{
                    ProductName="گوشی موبایل شیائومی مدل POCO X3 Pro M2102J20SG دو سیم‌ کارت ظرفیت 256 گیگابایت و 8 گیگابایت رم",
                    Description="گوشی موبایل شیائومی مدل Poco X3 Pro دو سیم‌ کارت ظرفیت 256 گیگابایت از جمله محصولات برند شیائومی که در سال 2021 روانه بازار شده است. این محصول دارای ساختاری متوازن و خوش‌ساخت بدون پشتیبانی از تکنولوژی 5G روانه بازار شده است. این محصول از بدنه پلاستیکی ساخته شده است که قاب جلو شیشه‌ای جلوه ویژه‌ای به این مدل بخشیده است. صفحه‌نمایش گوشی موبایل شیائومی مدل POCO X3 Pro دو سیم‌ کارت ظرفیت 256گیگابایت در اندازه 6.67 منتشر شده است. این صفحه‌نمایش کاملاً تمام‌صفحه است و در بالا وسط اثری از بریدگی یا حفره دوربین سلفی وجود دیده می‌شود. دوربین سلفی این محصول دارای حسگر 20 مگاپیکسلی است .صحفه‌نمایش گوشی موبایل شیائومی مدل POCO X3 با استفاده از فناوری Corning Gorilla Glass 6 در برابر خط‌وخش و صدمات احتمالی محافظت می‌شود. گفتنی است چهار دوربین که سنسور اصلی آن 48 مگاپیکسلی است در قسمت پشتی این گوشی جا خوش کرده‌اند. این دوربین‌ها قادر هستند ویدئوی 4K را ثبت و ضبط کنند. دوربین‌ سلفی این محصول هم به سنسوری 20 مگاپیکسلی مجهز شده است. بلوتوث نسخه 5.0، نسخه 11 سیستم عامل اندروید و باتری 5160 میلی‌آمپرساعتی از دیگر ویژگی‌‌های این گوشی جدید هستند.",
                    Price=6840000,
                    PictureURL="https://dkstatics-public.digikala.com/digikala-products/caa4e7d9543637cf8921b67f26803827c864e269_1618918880.jpg?x-oss-process=image/resize,h_1600/quality,q_80/watermark,image_ZGstdy8xLnBuZw==,t_90,g_nw,x_15,y_15",
                    Type="Xiaomi Mobiles",
                    Brand="Xiaomi",
                    QuantityInStock=100
                },new ProductEntity{
                    ProductName="گوشی موبایل اپل مدل iPhone SE 2020 A2275 ظرفیت 128 گیگابایت",
                    Description="شرکت اپل نسل دوم گوشی SEخود را در 15 آوریل 2020 معرفی کرد. این گوشی با بهره‌گیری از سخت‌افزار آیفون 11 و ابعاد جمع‌وجور به‌عنوان گوشی میان رده شرکت اپل روانه بازار شده است. قاب پشتی و جلویی آیفون SE از شیشه و فریم آن از آلومینیوم ساخته شده است. آیفون SE از یک صفحه‌نمایش 4.7 اینچی با فناوری Retina IPS بهره می‌برد. صفحه‌نمایش این گوشی دارای نسبت 16:9 است که رزولوشن آن برابر با 1334 در 750 پیکسل است. آیفون SE این‌بار در ظرفیت 256 گیگابایتی عرضه شده و طبق معمول خبری از امکان استفاده از کارت حافظه‌ی جانبی برای افزایش این مقدار نیست. شرکت اپل در ساخت گوشی SE 2020 از جدیدترین چیپست خود یعنی A13 Bionic با معماری 7nm+ استفاده کرده است. به لطف پردازنده‌ی جدید، آیفون SE می‌تواند به باند‌های LTE بیشتری متصل شود، همچنین از بلوتوث و Wi-Fi با نسخه‌های بالاتر با سرعت‌ بیشتر هم سود می‌برد. با این سنسور علاوه بر این‌که می‌توانید تصاویر با کیفیت‌تری ثبت کنید، می‌توانید تصاویر زنده ثبت کنید، ویدیو‌هایی با رزولوشن 4K ضبط کنید و یا از ضبط ویدیو‌هایی با سرعت 240 فریم بر ثانیه لذت ببرید. باتری آیفون SE خرید این گوشی به کسانی که هنوز از گوشی‌های کوچک استفاده می‌کنند و از نمایشگر‌های 4.7 اینچی رضایت دارند، توصیه می‌شود.",
                    Price=13290000,
                    PictureURL="https://dkstatics-public.digikala.com/digikala-products/122045219.jpg?x-oss-process=image/resize,m_lfit,h_600,w_600/quality,q_90",
                    Type="Iphone Mobiles",
                    Brand="Apple",
                    QuantityInStock=248
                },new ProductEntity{
                    ProductName="گوشی موبایل شیائومی مدل POCO X3 Pro M2102J20SG دو سیم‌ کارت ظرفیت 256 گیگابایت و 8 گیگابایت رم",
                    Description="گوشی موبایل شیائومی مدل Poco X3 Pro دو سیم‌ کارت ظرفیت 256 گیگابایت از جمله محصولات برند شیائومی که در سال 2021 روانه بازار شده است. این محصول دارای ساختاری متوازن و خوش‌ساخت بدون پشتیبانی از تکنولوژی 5G روانه بازار شده است. این محصول از بدنه پلاستیکی ساخته شده است که قاب جلو شیشه‌ای جلوه ویژه‌ای به این مدل بخشیده است. صفحه‌نمایش گوشی موبایل شیائومی مدل POCO X3 Pro دو سیم‌ کارت ظرفیت 256گیگابایت در اندازه 6.67 منتشر شده است. این صفحه‌نمایش کاملاً تمام‌صفحه است و در بالا وسط اثری از بریدگی یا حفره دوربین سلفی وجود دیده می‌شود. دوربین سلفی این محصول دارای حسگر 20 مگاپیکسلی است .صحفه‌نمایش گوشی موبایل شیائومی مدل POCO X3 با استفاده از فناوری Corning Gorilla Glass 6 در برابر خط‌وخش و صدمات احتمالی محافظت می‌شود. گفتنی است چهار دوربین که سنسور اصلی آن 48 مگاپیکسلی است در قسمت پشتی این گوشی جا خوش کرده‌اند. این دوربین‌ها قادر هستند ویدئوی 4K را ثبت و ضبط کنند. دوربین‌ سلفی این محصول هم به سنسوری 20 مگاپیکسلی مجهز شده است. بلوتوث نسخه 5.0، نسخه 11 سیستم عامل اندروید و باتری 5160 میلی‌آمپرساعتی از دیگر ویژگی‌‌های این گوشی جدید هستند.",
                    Price=6840000,
                    PictureURL="https://dkstatics-public.digikala.com/digikala-products/caa4e7d9543637cf8921b67f26803827c864e269_1618918880.jpg?x-oss-process=image/resize,h_1600/quality,q_80/watermark,image_ZGstdy8xLnBuZw==,t_90,g_nw,x_15,y_15",
                    Type="Xiaomi Mobiles",
                    Brand="Xiaomi",
                    QuantityInStock=100
                },new ProductEntity{
                    ProductName="گوشی موبایل شیائومی مدل POCO X3 Pro M2102J20SG دو سیم‌ کارت ظرفیت 256 گیگابایت و 8 گیگابایت رم",
                    Description="گوشی موبایل شیائومی مدل Poco X3 Pro دو سیم‌ کارت ظرفیت 256 گیگابایت از جمله محصولات برند شیائومی که در سال 2021 روانه بازار شده است. این محصول دارای ساختاری متوازن و خوش‌ساخت بدون پشتیبانی از تکنولوژی 5G روانه بازار شده است. این محصول از بدنه پلاستیکی ساخته شده است که قاب جلو شیشه‌ای جلوه ویژه‌ای به این مدل بخشیده است. صفحه‌نمایش گوشی موبایل شیائومی مدل POCO X3 Pro دو سیم‌ کارت ظرفیت 256گیگابایت در اندازه 6.67 منتشر شده است. این صفحه‌نمایش کاملاً تمام‌صفحه است و در بالا وسط اثری از بریدگی یا حفره دوربین سلفی وجود دیده می‌شود. دوربین سلفی این محصول دارای حسگر 20 مگاپیکسلی است .صحفه‌نمایش گوشی موبایل شیائومی مدل POCO X3 با استفاده از فناوری Corning Gorilla Glass 6 در برابر خط‌وخش و صدمات احتمالی محافظت می‌شود. گفتنی است چهار دوربین که سنسور اصلی آن 48 مگاپیکسلی است در قسمت پشتی این گوشی جا خوش کرده‌اند. این دوربین‌ها قادر هستند ویدئوی 4K را ثبت و ضبط کنند. دوربین‌ سلفی این محصول هم به سنسوری 20 مگاپیکسلی مجهز شده است. بلوتوث نسخه 5.0، نسخه 11 سیستم عامل اندروید و باتری 5160 میلی‌آمپرساعتی از دیگر ویژگی‌‌های این گوشی جدید هستند.",
                    Price=6840000,
                    PictureURL="https://dkstatics-public.digikala.com/digikala-products/caa4e7d9543637cf8921b67f26803827c864e269_1618918880.jpg?x-oss-process=image/resize,h_1600/quality,q_80/watermark,image_ZGstdy8xLnBuZw==,t_90,g_nw,x_15,y_15",
                    Type="Xiaomi Mobiles",
                    Brand="Xiaomi",
                    QuantityInStock=100
                },new ProductEntity{
                    ProductName="گوشی موبایل شیائومی مدل POCO X3 Pro M2102J20SG دو سیم‌ کارت ظرفیت 256 گیگابایت و 8 گیگابایت رم",
                    Description="گوشی موبایل شیائومی مدل Poco X3 Pro دو سیم‌ کارت ظرفیت 256 گیگابایت از جمله محصولات برند شیائومی که در سال 2021 روانه بازار شده است. این محصول دارای ساختاری متوازن و خوش‌ساخت بدون پشتیبانی از تکنولوژی 5G روانه بازار شده است. این محصول از بدنه پلاستیکی ساخته شده است که قاب جلو شیشه‌ای جلوه ویژه‌ای به این مدل بخشیده است. صفحه‌نمایش گوشی موبایل شیائومی مدل POCO X3 Pro دو سیم‌ کارت ظرفیت 256گیگابایت در اندازه 6.67 منتشر شده است. این صفحه‌نمایش کاملاً تمام‌صفحه است و در بالا وسط اثری از بریدگی یا حفره دوربین سلفی وجود دیده می‌شود. دوربین سلفی این محصول دارای حسگر 20 مگاپیکسلی است .صحفه‌نمایش گوشی موبایل شیائومی مدل POCO X3 با استفاده از فناوری Corning Gorilla Glass 6 در برابر خط‌وخش و صدمات احتمالی محافظت می‌شود. گفتنی است چهار دوربین که سنسور اصلی آن 48 مگاپیکسلی است در قسمت پشتی این گوشی جا خوش کرده‌اند. این دوربین‌ها قادر هستند ویدئوی 4K را ثبت و ضبط کنند. دوربین‌ سلفی این محصول هم به سنسوری 20 مگاپیکسلی مجهز شده است. بلوتوث نسخه 5.0، نسخه 11 سیستم عامل اندروید و باتری 5160 میلی‌آمپرساعتی از دیگر ویژگی‌‌های این گوشی جدید هستند.",
                    Price=6840000,
                    PictureURL="https://dkstatics-public.digikala.com/digikala-products/caa4e7d9543637cf8921b67f26803827c864e269_1618918880.jpg?x-oss-process=image/resize,h_1600/quality,q_80/watermark,image_ZGstdy8xLnBuZw==,t_90,g_nw,x_15,y_15",
                    Type="Xiaomi Mobiles",
                    Brand="Xiaomi",
                    QuantityInStock=100
                }

            };
            foreach (var product in products)
            {
                context.Product.Add(product);
            }
            context.SaveChanges();
        }
    }
}